---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WavePhase
source: html/207eb9fd-ba9c-3894-740b-a2e2642ea5c5.htm
---
# Autodesk.Revit.DB.Visual.Wave.WavePhase Property

The property labeled "Phase" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WavePhase { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 10000".